{
  "name": "Richard Silverton",
  "tagline": "Full-stack developer",
  "address": [
    "Apple Tree Cottage"
    "Orchard Road",
    "Melbourn",
    "Royston",
    "SG8 6BP",
    "silverton.richard@googlemail.com",
    "+44 (0)7747 095930"
  ],
  "summary": "<p>I'm a full-stack developer with almost 10 years experience working with web technologies, focused on the front end. I consider myself an expert in Javascript, Typescript, React, CSS and browser APIs, but I also have significant experience with Python, Rust, React Native, MongoDB, RethinkDB, Webpack, Bash, Git and Docker.</p><p>I love working with new technologies and experimenting with cutting-edge browser features, but I'm equally passionate about thinking through architectural decisions and using my experience to ensure any production code base that I work on is not only bug-free, but designed to be as reslient as possible to the introduction of bugs. Whilst I'm not from a strongly-typed CS background, I enjoy working with type systems and appreciate the way they focus my attention on the structure of data as well as code.</p><p>In more sociable times, I was a co-organiser of the London Meteor meetup, at which I've presented on a multitude of occasions <sup class=\"black-40 \">(1)(2)(3)</sup>, speaking about all aspects of full-stack development, and demonstrating a series of personal projects.</p><a class=\"f6 black-40 i db\" href=\"https://www.youtube.com/watch?v=v-yPPPjCk_I\">1: https://www.youtube.com/watch?v=v-yPPPjCk_I</a><a class=\"black-40 i db\" href=\"https://www.youtube.com/watch?v=rWcXAhUkp6Y\">2: https://www.youtube.com/watch?v=rWcXAhUkp6Y</a><a class=\"black-40 i db\" href=\"https://www.youtube.com/watch?v=O15hAIsncO8\">3: https://www.youtube.com/watch?v=O15hAIsncO8</a>",
  
  "employmentHistory": [
    {
      "employer": "Re:infer",
      "role": "Lead front-end developer",
      "dates": "July 2017-present",
      "description": "<p class=\"f6 lh-copy\">I lead front-end development for an artificial intelligence startup, which utilises cutting-edge NLP to deliver analytics and automation over large collections of emails and chat data. I lead a small team of experienced engineers who are responsible for building and maintaining our complex web app, making architectural decisions and managing the feature development process alongside a product manager, but a lot of my role is hands-on development and code review.</p><p class=\"f6 lh-copy\">The app provides a sophisticated interface that allows non-technical users to train cutting-edge machine learning models, validate their results, see detailed analysis of the data, and set up automations. It's written in Typescript, React, Redux and Material-UI, with an API service written in Python to which I also contribute.</p>"
    },
    {
      "employer": "TABLEFLIP",
      "role": "Full-stack developer",
      "dates": "November 2014–July 2017",
      "description": "<p class=\"f6 lh-copy\">Working as part of a boutique agency, I built complex web and native applications from the ground up for clients across a range of industries, from startups to major international corporations. Technologies included React, Redux, MongoDB, Meteor.js, Node, Express and Ansible.</p>"
    },
    {
      "employer": "Change, Grow, Live (formerly CRI Ltd)",
      "role": "Financial consultant – Transforming Rehabilitation project",
      "dates": "March 2014–October 2014",
      "description": "I was responsible for delivering the financial analysis component of the organisation's bids for the Ministry of Justice's ground-breaking Transforming Rehabilitation initiative. I reported directly to the charity's board and the MoJ on all financial aspects of the process."
    },
    {
      "employer": "Various",
      "role": "Full-stack developer",
      "dates": "March 2013–March 2014",
      "description": "After deciding to leave trading to become a developer, I spent around a year intensively teaching myself Python and Javascript via online resources including Udacity and Coursera.  I put these skills to work by developing sites for my running club's racing league, a fantasy biathlon game which was internationally popular and mentioned on TV, a successful e-commerce site and an annual charity football event, amongst other personal projects."
    },
    {
      "employer": "Goldman Sachs", 
      "dates": "2003–2006 and 2007–2013",
      "role": "Vice president, Short-term interest rates trading",
      "description": "I was responsible for market-making and discretionary trading of international interest rate products and foreign exchange to manage credit, market and funding risks. I also provided market intelligence and personal trading views to high-profile clients including central banks."
    },
    {
      "employer": "IHS Markit",
      "dates": "June 2007–September 2007",
      "role": "Quantitative analyst, Valuations group",
      "description": "I developed a flexible CDO pricing model which could be calibrated to prevailing market correlations in Matlab."
    }
  ],
  "education": [
    {
      "name": "Bayes Business School",
      "dates": "2006–2007",
      "details": "Masters in Mathematical Trading and Finance, MSc. degree (Distinction)"
    },
    {
      "name": "University of Nottingham", 
      "dates": "1998–2002",
	    "details": "Masters in Mathematics, MMath. (Hons) degree (2:1)"
    }
  ],
  "personalProjects": [
    {
      "name": "CV",
      "details": "The contents of this CV are stored on Github in JSON format; changing them invokes an AWS Lambda function via a webhook, which rebuilds the pdf and stores it on Amazon S3.",
      "link": "https://github.com/richsilv/cv"
    },
    {
      "name": "React render-when-visible",
      "details": "An experimental hook which easily allows selective rerendering of components based on whether they appear in a given view-pane for improving the performance of React apps."
      "link": "https://codesandbox.io/s/rerenderwhenvisible-lo4qg"
    },
    {
      "name": "React sticky-container",
      "details": "A React/JS implementation of the native position: sticky behaviour for situations in which the equivalent CSS can't be used."
      "link": "https://codesandbox.io/s/sticky-container"
    },
    {
      "name": "CSS Transition Group reimplementation",
      "details": "A plug-in replacement for the old CSSTransitionGroup, designed to work with modern React."
      "link": "https://codesandbox.io/s/css-transition-group-fqx4j"
    },
    {
      "name": "Graffiti wall",
      "details": "An early (and gratuitous) experiment with using React hooks to do as much as possible in a small amount of code."
      "link": "https://codesandbox.io/s/7y64opw7n6"
    },
    {
      "name": "Neural",
      "details": "A dependency-free neural network library based on ES6 generators which runs on Node.js and in the browser.",
      "link": "https://github.com/richsilv/neural"
    },
    {
      "name": "Colour scheme generator",
      "details": "A tool to generate a realistic colour palette from a single base colour.",
      "link": "https://github.com/richsilv/color-scheme"
    }
  ],
  "profiles": [
    {
      "network": "Github",
      "fa": "github",
      "link": "https://github.com/richsilv",
      "username": "richsilv"
    },
    {
      "network": "StackOverflow",
      "fa": "stack-overflow",
      "link": "http://stackoverflow.com/users/2068581/richsilv",
      "username": "richsilv"
    }
  ],
  "width": "55em"
}
